nxp-mcuxpresso/mcux-sdk/devices/LPC54005/LPC54005.h
#define OTPC_BOOTROM_ISP_IAP_DISABLED_MASK       (0x100U)
#define OTPC_BOOTROM_ISP_IAP_DISABLED_SHIFT      (8U)
/*! ISP_IAP_DISABLED - ISP entry through IAP API.
 */
#define OTPC_BOOTROM_ISP_IAP_DISABLED(x)         (((uint32_t)(((uint32_t)(x)) << OTPC_BOOTROM_ISP_IAP_DISABLED_SHIFT)) & OTPC_BOOTROM_ISP_IAP_DISABLED_MASK)

#define OTPC_BOOTROM_BOOT_SRC_MASK               (0x600U)
#define OTPC_BOOTROM_BOOT_SRC_SHIFT              (9U)
/*! BOOT_SRC - Boot source.
 */
#define OTPC_BOOTROM_BOOT_SRC(x)                 (((uint32_t)(((uint32_t)(x)) << OTPC_BOOTROM_BOOT_SRC_SHIFT)) & OTPC_BOOTROM_BOOT_SRC_MASK)

#define OTPC_BOOTROM_ISP_MODE_MASK               (0x1800U)
#define OTPC_BOOTROM_ISP_MODE_SHIFT              (11U)
/*! ISP_MODE - Fall through ISP mode.
 */
#define OTPC_BOOTROM_ISP_MODE(x)                 (((uint32_t)(((uint32_t)(x)) << OTPC_BOOTROM_ISP_MODE_SHIFT)) & OTPC_BOOTROM_ISP_MODE_MASK)

#define OTPC_BOOTROM_SWDEN1_MASK                 (0x2000U)
#define OTPC_BOOTROM_SWDEN1_SHIFT                (13U)
/*! SWDEN1 - This bit along with bit SWD_EN0 is used to control enabling/disabling.
 */
#define OTPC_BOOTROM_SWDEN1(x)                   (((uint32_t)(((uint32_t)(x)) << OTPC_BOOTROM_SWDEN1_SHIFT)) & OTPC_BOOTROM_SWDEN1_MASK)

#define OTPC_BOOTROM_USE_PUF_MASK                (0x4000U)
#define OTPC_BOOTROM_USE_PUF_SHIFT               (14U)
/*! USE_PUF - Encryption key supplied by PUF.
 */
#define OTPC_BOOTROM_USE_PUF(x)                  (((uint32_t)(((uint32_t)(x)) << OTPC_BOOTROM_USE_PUF_SHIFT)) & OTPC_BOOTROM_USE_PUF_MASK)

#define OTPC_BOOTROM_BLOCK_PUF_ENROLL_KEY_CODE_MASK (0x8000U)
#define OTPC_BOOTROM_BLOCK_PUF_ENROLL_KEY_CODE_SHIFT (15U)
/*! BLOCK_PUF_ENROLL_KEY_CODE - Block PUF enrollment and key code generation.
 */
#define OTPC_BOOTROM_BLOCK_PUF_ENROLL_KEY_CODE(x) (((uint32_t)(((uint32_t)(x)) << OTPC_BOOTROM_BLOCK_PUF_ENROLL_KEY_CODE_SHIFT)) & OTPC_BOOTROM_BLOCK_PUF_ENROLL_KEY_CODE_MASK)

#define OTPC_BOOTROM_QSPI_DELAY_MASK             (0xE0000U)
#define OTPC_BOOTROM_QSPI_DELAY_SHIFT            (17U)
/*! QSPI_DELAY - Amount of delay ROM has o wait after POR reset before access QSPI flash device.
 */
#define OTPC_BOOTROM_QSPI_DELAY(x)               (((uint32_t)(((uint32_t)(x)) << OTPC_BOOTROM_QSPI_DELAY_SHIFT)) & OTPC_BOOTROM_QSPI_DELAY_MASK)

#define OTPC_BOOTROM_USER_APPLICATION_MASK       (0xF00000U)
#define OTPC_BOOTROM_USER_APPLICATION_SHIFT      (20U)
/*! USER_APPLICATION - Fall through ISP mode.
 */
#define OTPC_BOOTROM_USER_APPLICATION(x)         (((uint32_t)(((uint32_t)(x)) << OTPC_BOOTROM_USER_APPLICATION_SHIFT)) & OTPC_BOOTROM_USER_APPLICATION_MASK)

#define OTPC_BOOTROM_REVOKE_ID_MASK              (0xFF000000U)
#define OTPC_BOOTROM_REVOKE_ID_SHIFT             (24U)
/*! REVOKE_ID - Key and image revocation identifier in secure authenticated mode.
 */
#define OTPC_BOOTROM_REVOKE_ID(x)                (((uint32_t)(((uint32_t)(x)) << OTPC_BOOTROM_REVOKE_ID_SHIFT)) & OTPC_BOOTROM_REVOKE_ID_MASK)
/*! @} */


/*!
 * @}
 */ /* end of group OTPC_Register_Masks */


/* OTPC - Peripheral instance base addresses */
/** Peripheral OTPC base address */
#define OTPC_BASE                                (0x40015000u)
/** Peripheral OTPC base pointer */
#define OTPC                                     ((OTPC_Type *)OTPC_BASE)
/** Array initializer of OTPC peripheral base addresses */
#define OTPC_BASE_ADDRS                          { OTPC_BASE }
/** Array initializer of OTPC peripheral base pointers */
#define OTPC_BASE_PTRS                           { OTPC }

/*!
 * @}
 */ /* end of group OTPC_Peripheral_Access_Layer */


/* ----------------------------------------------------------------------------
   -- PINT Peripheral Access Layer
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup PINT_Peripheral_Access_Layer PINT Peripheral Access Layer
 * @{
 */

/** PINT - Register Layout Typedef */
typedef struct {
  __IO uint32_t ISEL;                              /**< Pin Interrupt Mode register, offset: 0x0 */
  __IO uint32_t IENR;                              /**< Pin interrupt level or rising edge interrupt enable register, offset: 0x4 */
  __O  uint32_t SIENR;                             /**< Pin interrupt level or rising edge interrupt set register, offset: 0x8 */
  __O  uint32_t CIENR;                             /**< Pin interrupt level (rising edge interrupt) clear register, offset: 0xC */
  __IO uint32_t IENF;                              /**< Pin interrupt active level or falling edge interrupt enable register, offset: 0x10 */
  __O  uint32_t SIENF;                             /**< Pin interrupt active level or falling edge interrupt set register, offset: 0x14 */
  __O  uint32_t CIENF;                             /**< Pin interrupt active level or falling edge interrupt clear register, offset: 0x18 */
  __IO uint32_t RISE;                              /**< Pin interrupt rising edge register, offset: 0x1C */
  __IO uint32_t FALL;                              /**< Pin interrupt falling edge register, offset: 0x20 */
  __IO uint32_t IST;                               /**< Pin interrupt status register, offset: 0x24 */
  __IO uint32_t PMCTRL;                            /**< Pattern match interrupt control register, offset: 0x28 */
  __IO uint32_t PMSRC;                             /**< Pattern match interrupt bit-slice source register, offset: 0x2C */
  __IO uint32_t PMCFG;                             /**< Pattern match interrupt bit slice configuration register, offset: 0x30 */
} PINT_Type;

/* ----------------------------------------------------------------------------
   -- PINT Register Masks
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup PINT_Register_Masks PINT Register Masks
 * @{
 */

/*! @name ISEL - Pin Interrupt Mode register */
/*! @{ */

#define PINT_ISEL_PMODE_MASK                     (0xFFU)
#define PINT_ISEL_PMODE_SHIFT                    (0U)
/*! PMODE - Selects the interrupt mode for each pin interrupt. Bit n configures the pin interrupt
 *    selected in PINTSELn. 0 = Edge sensitive 1 = Level sensitive
 */
#define PINT_ISEL_PMODE(x)                       (((uint32_t)(((uint32_t)(x)) << PINT_ISEL_PMODE_SHIFT)) & PINT_ISEL_PMODE_MASK)
/*! @} */

/*! @name IENR - Pin interrupt level or rising edge interrupt enable register */
/*! @{ */

#define PINT_IENR_ENRL_MASK                      (0xFFU)
#define PINT_IENR_ENRL_SHIFT                     (0U)
/*! ENRL - Enables the rising edge or level interrupt for each pin interrupt. Bit n configures the
 *    pin interrupt selected in PINTSELn. 0 = Disable rising edge or level interrupt. 1 = Enable
 *    rising edge or level interrupt.
 */
#define PINT_IENR_ENRL(x)                        (((uint32_t)(((uint32_t)(x)) << PINT_IENR_ENRL_SHIFT)) & PINT_IENR_ENRL_MASK)
/*! @} */

